Tekla Open API Reference for Tekla Structures 2025
View.ViewRendering Property
The view rendering type.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.ViewRenderingType ViewRendering { get; }
Public ReadOnly Property ViewRendering As View.ViewRenderingType
	Get
Property Value
Type: View.ViewRenderingType
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace